import { useState, React } from "react";
import "../../ style/PeopleList.css";

const peopleData = [

        {
          id: 1,
          name: "Ліфінцев Л.М.",
          description: "Начальник механізованого загону Ліфінцев Л.М. нагороджений орденом Леніна, орденами Жовтневої Революції та Трудового Червоного прапора.",
          photoUrl: "посилання_на_фото_Ліфінцев_ЛМ"
        },
        {
          id: 2,
          name: "Саніна М.П.",
          description: "Доярка Саніна М.П. нагороджена орденами Жовтневої Революції та Трудового Червоного Прапора.",
          photoUrl: "посилання_на_фото_Саніна_МП"
        },
        {
          id: 3,
          name: "Стеблина Л.О.",
          description: "Доярка Стеблина Л.О. – делегат Всесоюзного ІІІ з’їзду колгоспників, нагороджена орденами Жовтневої Революції та «Знак пошани».",
          photoUrl: "посилання_на_фото_Стеблина_ЛО"
        },
        {
          id: 4,
          name: "Портний Т.А.",
          description: "Знатний механізатор Портний Т.А. – почесний колгоспник, учасник Великої Вітчизняної війни, нагороджений орденом «Знак пошани» та медаллю «За трудову доблесть».",
          photoUrl: "посилання_на_фото_Портний_ТА"
        },
        {
          id: 5,
          name: "Ходос В.С.",
          description: "Шофер Ходос В.С. – пізніше механізатор, нагороджений орденом «Знак пошани» та орденом Трудової слави ІІ ступеня.",
          photoUrl: "посилання_на_фото_Ходос_ВС"
        } ,
        {
            id: 6,
            name: "Оксененко І.А.",
            description: "Знатний тракторист Оксененко І.А., відзначений двома орденами «Знак пошани».",
            photoUrl: "посилання_на_фото_Оксененко_ІА"
          },
          {
            id: 7,
            name: "Стеблина І.П.",
            description: "Знатний комбайнер Стеблина І.П., нагороджений орденами «Знак пошани» та Трудового Червоного прапора.",
            photoUrl: "посилання_на_фото_Стеблина_ІП"
          },
          {
            id: 8,
            name: "Шешеня П.В.",
            description: "Знатний комбайнер Шешеня П.В., відзначений орденом «Знак пошани».",
            photoUrl: "посилання_на_фото_Шешеня_ПВ"
          },
          {
            id: 9,
            name: "Касьяненко В.А.",
            description: "Передовий комбайнер Касьяненко В.А., удостоєний орденом «Знак пошани».",
            photoUrl: "посилання_на_фото_Касьяненко_ВА"
          },
          {
            id: 10,
            name: "Носенко В.Є.",
            description: "Передовий комбайнер Каховського району Носенко В.Є., нагороджений медаллю «За трудову доблесть» та орденом Трудового Червоного прапора.",
            photoUrl: "посилання_на_фото_Носенко_ВЄ"
          },
          {
            id: 11,
            name: "Саніна М.П.",
            description: "Одна з кращих доярок з Каховського району Саніна М.П., удостоєна орденом Жовтневої Революції.",
            photoUrl: "посилання_на_фото_Саніна_МП"
          },
          {
            id: 12,
            name: "Штефан М.Л.",
            description: "Передовий механізатор Штефан М.Л., відзначений орденами Трудової слави ІІ та ІІІ ступеня.",
            photoUrl: "посилання_на_фото_Штефан_МЛ"
          },
          {
            id: 13,
            name: "Прудський І.П.",
            description: "Передовий механізатор Прудський І.П., нагороджений орденами Трудової слави ІІ та ІІІ ступеня.",
            photoUrl: "посилання_на_фото_Прудський_ІП"
          },
          {
            id: 14,
            name: "Черняєва Л.І.",
            description: "Доярка Черняєва Л.І., відзначена орденом Трудового Червоного прапора.",
            photoUrl: "посилання_на_фото_Черняєва_ЛІ"
          },
          {
            id: 15,
            name: "Слісаренко З.У.",
            description: "Передова доярка Слісаренко З.У., удостоєна орденом «Знак пошани».",
            photoUrl: "посилання_на_фото_Слісаренко_ЗУ"
          },
          {
            id: 16,
            name: "Ліфінцев В.М.",
            description: "Голова сільської ради декількох скликань Ліфінцев В.М., нагороджений орденом «Знак пошани».",
            photoUrl: "посилання_на_фото_Ліфінцев_ВМ"
          },
          {
            id: 17,
            name: "Баран І.Г.",
            description: "Передовий шофер колгоспу Баран І.Г., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Баран_ІГ"
          },
          {
            id: 18,
            name: "Моша Н.М.",
            description: "Завідуюча свинофермою Моша Н.М., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Моша_НМ"
          },
          {
            id: 19,
            name: "Новосельцева Г.М.",
            description: "Головний зоотехнік колгоспу Новосельцева Г.М., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Новосельцева_ГМ"
          },
          {
            id: 20,
            name: "Савина Л.П.",
            description: "Бригадир польової бригади Савина Л.П., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Савина_ЛП"
          },
          {
            id: 21,
            name: "Денисенко Н.С.",
            description: "Свинарка Денисенко Н.С., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Денисенко_НС"
          },
          {
            id: 22,
            name: "Саніна С.І.",
            description: "Свинарка Саніна С.І., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Саніна_СІ"
          },
          {
            id: 23,
            name: "Меленчук Р.І.",
            description: "Свинарка Меленчук Р.І., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Меленчук_РІ"
          },
          {
            id: 24,
            name: "Баранова В.М.",
            description: "Доярка Баранова В.М., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Баранова_ВМ"
          },
          {
            id: 25,
            name: "Васильєва Г.М.",
            description: "Доярка Васильєва Г.М., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Васильєва_ГМ"
          },
          {
            id: 26,
            name: "Пуляєва Н.М",
            description: "Доярка Пуляєва Н.М., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Пуляєва_НМ"
          },
          {
            id: 27,
            name: "Ступка Н.А.",
            description: "Доярка Ступка Н.А., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Ступка_НА"
          },
          {
            id: 28,
            name: "Пуляєв І.С.",
            description: "Майстер наладчик Пуляєв І.С., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Пуляєв_ІС"
          },
          {
            id: 29,
            name: "Охріменко Л.М.",
            description: "Колгоспниця Охріменко Л.М., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Охріменко_ЛМ"
          },
          {
            id: 30,
            name: "Шахов П.І.",
            description: "Скотар Шахов П.І., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Шахов_ПІ"
          },
          {
            id: 31,
            name: "Хмеловський В.Г.",
            description: "Завідуючий фермою Хмеловський В.Г., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Хмеловський_ВГ"
          },
          {
            id: 32,
            name: "Копича М.П.",
            description: "Колгоспниця Копича М.П., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Копича_МП"
          },
          {
            id: 33,
            name: "Охріменко С.І.",
            description: "Секретар партійної організації Охріменко С.І., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Охріменко_СІ"
          },
          {
            id: 34,
            name: "Карпенко Н.А.",
            description: "Телятниця Карпенко Н.А., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Карпенко_НА"
          },
          {
            id: 35,
            name: "Саніна К.М.",
            description: "Телятниця Саніна К.М., ім'я занесене на Дошку Пошани та Книгу Пошани.",
            photoUrl: "посилання_на_фото_Саніна_КМ"
          },
          {
            id: 36,
            name: "Охріменко Г.М.",
            description: "Учитель, командир колгоспної санітарної дружини, визнаний кращим в районі та одним з кращих в Херсонській області.",
            photoUrl: "посилання_на_фото_Охріменко_ГМ"
          },
          {
            id: 37,
            name: "Мороз Н.Ф.",
            description: "Завідуюча дитячим садком Мороз Н.Ф., яка віддавала все своє серце дитячій освіті та вихованню.",
            photoUrl: "посилання_на_фото_Мороз_НФ"
          },
          {
            id: 38,
            name: "Ліфінцева В.М.",
            description: "Медична сестра Ліфінцева В.М., що завжди готова була допомогти у разі потреби.",
            photoUrl: "посилання_на_фото_Ліфінцева_ВМ"
          },
          {
            id: 39,
            name: "Зайцева Є.І.",
            description: "Завгосп Зайцева Є.І., яка докладала зусиль для забезпечення належного функціонування садочка.",
            photoUrl: "посилання_на_фото_Зайцева_ЄІ"
          },
          {
            id: 40,
            name: "Бондар В.С.",
            description: "Професійна прачка Бондар В.С., яка забезпечувала чистоту та порядок у дитячому садочку.",
            photoUrl: "посилання_на_фото_Бондар_ВС"
          },
          {
            id: 41,
            name: "Михайленко О.Ф.",
            description: "Вихователька Михайленко О.Ф., яка з любов'ю та турботою виховувала дітей.",
            photoUrl: "посилання_на_фото_Михайленко_ОФ"
          },
          {
            id: 42,
            name: "Петрович Т.М.",
            description: "Вихователька Петрович Т.М., яка присвятила своє життя дітям та їхньому вихованню.",
            photoUrl: "посилання_на_фото_Петрович_ТМ"
          },
          {
            id: 43,
            name: "Волкова Н.Г.",
            description: "Вихователька Волкова Н.Г., яка займалася дітьми з великою увагою та розумінням.",
            photoUrl: "посилання_на_фото_Волкова_НГ"
          },
          {
            id: 44,
            name: "Мельник Л.Ф.",
            description: "Вихователька Мельник Л.Ф., яка допомагала дітям розвивати їхні таланти та здібності.",
            photoUrl: "посилання_на_фото_Мельник_ЛФ"
          },
          {
            id: 45,
            name: "Воробйова Л.Л.",
            description: "Вихователька Воробйова Л.Л., яка працювала над формуванням добрих моральних цінностей у дітей.",
            photoUrl: "посилання_на_фото_Воробйова_ЛЛ"
          },
          {
            id: 46,
            name: "Хлистова Н.М.",
            description: "Вихователька Хлистова Н.М., яка забезпечувала цікаве та пізнавальне середовище для дітей.",
            photoUrl: "посилання_на_фото_Хлистова_НМ"
          },
          {
            id: 47,
            name: "Михайлюк А.С.",
            description: "Активна учасниця художньої самодіяльності, яка завжди розносила радість своєю піснею.",
            photoUrl: "посилання_на_фото_Михайлюк_АС"
          },
          {
            id: 48,
            name: "Підкова К.М.",
            description: "Активна учасниця художньої самодіяльності, яка завжди робила настрій своєю музикою.",
            photoUrl: "посилання_на_фото_Підкова_КМ"
          },
          {
            id: 49,
            name: "Шаповалова Т.А.",
            description: "Активна учасниця художньої самодіяльності, яка завжди вражала своїм вокалом.",
            photoUrl: "посилання_на_фото_Шаповалова_ТА"
          },
          {
            id: 50,
            name: "Хлистова М.О.",
            description: "Активна учасниця художньої самодіяльності, яка завжди дарувала свою музику.",
            photoUrl: "посилання_на_фото_Хлистова_МО"
          },
          {
            id: 51,
            name: "Вербиченька",
            description: "Ансамбль, удостоєний звання «Народний колектив», який продовжує традиції та зберігає культурний доробок села.",
            photoUrl: "посилання_на_фото_Вербиченька"
          },
          {
            id: 52,
            name: "Семенівська сільська рада",
            description: "Головний орган місцевого самоврядування, який відіграє важливу роль у господарському та культурному розвитку села Семенівка.",
            photoUrl: "посилання_на_фото_Семенівська_сільська_рада"
          },
          {
            id: 53,
            name: "Онищенко Іван Іванович",
            description: "Перший голова Семенівської сільської ради, який вніс вагому спадщину в розвиток села.",
            photoUrl: "посилання_на_фото_Онищенко_Іван_Іванович"
          },
          {
            id: 54,
            name: "Хлистова Н.М.",
            description: "Професійна бухгалтерка та головний бухгалтер, яка працювала на благо розвитку села протягом 35 років.",
            photoUrl: "посилання_на_фото_Хлистова_НМ"
          },
          {
            id: 55,
            name: "Охріменко Л.І.",
            description: "Віддана працівниця, яка працювала на посаді паспортиста та інспектора військово-облікового столу протягом понад 30 років.",
            photoUrl: "посилання_на_фото_Охріменко_ЛІ"
          },
          {
            id: 56,
            name: "Мазур Л.М.",
            description: "Секретар сільської ради, яка безперервно",
            photoUrl:"",
          },
          {
            id: 57,
            name: "Фермерське господарство «Алтанал»",
            description: "Підприємство, керівником якого є Червіоний О.В., володар громадського ордена «Лицар Вітчизни» Золотий хрест честі і звитяги.",
            photoUrl: "посилання_на_фото_ФГ_Алтанал"
          },
          {
            id: 58,
            name: "ППСК «Зорецвіт»",
            description: "Сільськогосподарське підприємство, керівником якого є Король В.В.",
            photoUrl: "посилання_на_фото_ППСК_Зорецвіт"
          },
          {
            id: 59,
            name: "ДП «Югагрофорс»",
            description: "Державне підприємство, керівником якого є Купенко В.В.",
            photoUrl: "посилання_на_фото_ДП_Югагрофорс"
          },
          {
            id: 60,
            name: "Фермерське господарство «Віта»",
            description: "Сільськогосподарське підприємство, керівником якого є Гуцов В.І.",
            photoUrl: "посилання_на_фото_ФГ_Віта"
          },
          {
            id: 61,
            name: "ТОВ «Агростар»",
            description: "Товариство з обмеженою відповідальністю, керівником якого є Лохматов Є.В.",
            photoUrl: "посилання_на_фото_ТОВ_Агростар"
          },
          {
            id: 62,
            name: "Фермерське господарство «Віксан»",
            description: "Сільськогосподарське підприємство, керівником якого є Санін В.О.",
            photoUrl: "посилання_на_фото_ФГ_Віксан"
          },
          {
            id: 63,
            name: "ТОВ «Південь-Агрокомінвест»",
            description: "Товариство з обмеженою відповідальністю, керівником якого є Бабаєв Р.Д.",
            photoUrl: "посилання_на_фото_ТОВ_Південь-Агрокомінвест"
          },
          {
            id: 64,
            name: "Фермерське господарство «Оля»",
            description: "Сільськогосподарське підприємство, керівником якого є Якушенко І.Г.",
            photoUrl: "посилання_на_фото_ФГ_Оля"
          }
     
      ];

// Оновлений масив об'єктів з новим значенням photoUrl
const updatedPeopleData = peopleData.map(person => ({
    ...person,
    photoUrl: "https://www.iconpacks.net/icons/1/free-user-icon-295-thumb.png"
  }));
  
  const PeopleList = () => {
    const [pageIndex, setPageIndex] = useState(0); // Стан для відстеження поточної сторінки
  
    const nextPage = () => {
      setPageIndex(prevIndex => (prevIndex + 1) % Math.ceil(updatedPeopleData.length / 10));
    };
  
    const prevPage = () => {
      setPageIndex(prevIndex => (prevIndex - 1 + Math.ceil(updatedPeopleData.length / 10)) % Math.ceil(updatedPeopleData.length / 10));
    };
  
    return (
      <>

      <div className="people-list">
        {updatedPeopleData.slice(pageIndex * 10, pageIndex * 10 + 10).map((person, index) => (
          <div key={person.id} className="person">
            <h2>{pageIndex * 10 + index + 1}. {person.name}</h2>
            <img src={person.photoUrl} alt={person.name} />
            <p>{person.description}</p>
            {(index !== 9 && index !== updatedPeopleData.slice(pageIndex * 10).length - 1) && <hr />} {/* Додаємо лінію розділення, якщо це не останній елемент */}
          </div>
        ))}
   
        
 
    
      </div>
      <div style={{ display: 'flex', justifyContent: 'space-between', width: '100%' }}>
  <button style={{ width: '20%', marginLeft:'400px', backgroundColor: 'rgb(26, 125, 255)' }} onClick={nextPage}>Next</button>
  <button style={{ width: '20%',  backgroundColor: 'rgb(20, 152, 228)' }} onClick={prevPage}>Prev</button>
</div>

      </>
    );
  };
  
  export default PeopleList;